create_clock -period 10 -name clk [get_ports clk]
set_clock_latency -source -max 3 [get_clock clk]
set_clock_latency 1 [get_clock clk]
set_clock_uncertainty -setup 0.5 [get_clock clk]
set_clock_uncertainty -hold 0.2 [get_clock clk]
set_input_delay -clock clk -max 3 [get_ports A[0]]
set_input_delay -clock clk -max 3 [get_ports A[1]]
set_input_delay -clock clk -max 3 [get_ports A[2]]
set_input_delay -clock clk -max 3 [get_ports A[3]]
set_input_delay -clock clk -max 3 [get_ports B[0]]
set_input_delay -clock clk -max 3 [get_ports B[1]]
set_input_delay -clock clk -max 3 [get_ports B[2]]
set_input_delay -clock clk -max 3 [get_ports B[3]]
set_input_delay -clock clk -max 3 [get_ports rst] 
set_input_delay -clock clk -min 1 [get_ports A[1]]
set_input_delay -clock clk -min 1 [get_ports A[0]]
set_input_delay -clock clk -min 1 [get_ports A[2]]
set_input_delay -clock clk -min 1 [get_ports A[3]]
set_input_delay -clock clk -min 1 [get_ports B[0]]
set_input_delay -clock clk -min 1 [get_ports B[1]]
set_input_delay -clock clk -min 1 [get_ports B[2]]
set_input_delay -clock clk -min 1 [get_ports B[3]]
set_input_delay -clock clk -min 1 [get_ports rst] 
set_input_delay -clock clk -max 3 [get_ports mode[0]]
set_input_delay -clock clk -max 3 [get_ports mode[1]]    
set_input_delay -clock clk -max 3 [get_ports mode[2]]
set_input_delay -clock clk -min 1 [get_ports mode[0]]
set_input_delay -clock clk -min 1 [get_ports mode[1]]
set_input_delay -clock clk -min 1 [get_ports mode[2]]
set_input_transition -max 0.5 [get_ports A[0]]
set_input_transition -max 0.5 [get_ports A[1]]
set_input_transition -max 0.5 [get_ports A[2]]
set_input_transition -max 0.5 [get_ports A[3]]
set_input_transition -max 0.5 [get_ports B[0]]
set_input_transition -max 0.5 [get_ports B[1]]
set_input_transition -max 0.5 [get_ports B[2]]
set_input_transition -max 0.5 [get_ports B[3]]
set_input_transition -max 0.5 [get_ports rst] 
set_input_transition -min 0.1 [get_ports A[0]]
set_input_transition -min 0.1 [get_ports A[1]]
set_input_transition -min 0.1 [get_ports A[2]]
set_input_transition -min 0.1 [get_ports A[3]]
set_input_transition -min 0.1 [get_ports B[0]]
set_input_transition -min 0.1 [get_ports B[1]]
set_input_transition -min 0.1 [get_ports B[2]]
set_input_transition -min 0.1 [get_ports B[3]]
set_input_transition -min 0.1 [get_ports rst] 
set_input_transition -max 0.5 [get_ports mode[0]]
set_input_transition -max 0.5 [get_ports mode[1]]
set_input_transition -max 0.5 [get_ports mode[2]]
set_input_transition -min 0.1 [get_ports mode[0]]
set_input_transition -min 0.1 [get_ports mode[1]]
set_input_transition -min 0.1 [get_ports mode[2]]
set_output_delay -clock clk -max 5 [get_ports y[0]]
set_output_delay -clock clk -max 5 [get_ports y[1]]
set_output_delay -clock clk -max 5 [get_ports y[2]]
set_output_delay -clock clk -max 5 [get_ports y[3]]
set_output_delay -clock clk -max 5 [get_ports y[4]]
set_output_delay -clock clk -max 5 [get_ports y[5]]
set_output_delay -clock clk -max 5 [get_ports y[6]]
set_output_delay -clock clk -max 5 [get_ports y[7]]
set_output_delay -clock clk -min 1 [get_ports y[0]]
set_output_delay -clock clk -min 1 [get_ports y[1]]
set_output_delay -clock clk -min 1 [get_ports y[2]]
set_output_delay -clock clk -min 1 [get_ports y[3]]
set_output_delay -clock clk -min 1 [get_ports y[4]]
set_output_delay -clock clk -min 1 [get_ports y[5]]
set_output_delay -clock clk -min 1 [get_ports y[6]]
set_output_delay -clock clk -min 1 [get_ports y[7]]
set_load -max 0.4 [get_ports y]
set_load -min 0.1 [get_ports y]
